Messwerte/Archiv/Raw/apache_benchmark_repeat35/max/kata/tomcat/target_count_13/repeat_34/8.txt
2020/01/26 16:41:29 Running: ab -c 100 -t 30 -n 1000000 http://192.168.3.100:8008/
2020/01/26 16:41:59 This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/
{"connect":{"max":1068,"mean":23,"median":8,"min":0,"stdDev":81.19999694824219},"percentiles":{"100":1284,"50":34,"66":54,"75":71,"80":82,"90":129,"95":198,"98":287,"99":340},"processing":{"max":945,"mean":38,"median":23,"min":0,"stdDev":48.5},"total":{"max":1284,"mean":62,"median":34,"min":1,"stdDev":100.30000305175781},"waiting":{"max":695,"mean":37,"median":23,"min":0,"stdDev":44.099998474121094}}
Benchmarking 192.168.3.100 (be patient)
Finished 47078 requests
Server Software:        
Server Hostname:        192.168.3.100
Server Port:            8008
Document Path:          /
Document Length:        713 bytes
Concurrency Level:      100
Time taken for tests:   30.000 seconds
Complete requests:      47078
Failed requests:        0
Non-2xx responses:      47083
Total transferred:      40868044 bytes
HTML transferred:       33570179 bytes
Requests per second:    1569.26 [#/sec] (mean)
Time per request:       63.724 [ms] (mean)
Time per request:       0.637 [ms] (mean, across all concurrent requests)
Transfer rate:          1330.34 [Kbytes/sec] received
Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0   23  81.2      8    1068
Processing:     0   38  48.5     23     945
Waiting:        0   37  44.1     23     695
Total:          1   62 100.3     34    1284
Percentage of the requests served within a certain time (ms)
  50%     34
  66%     54
  75%     71
  80%     82
  90%    129
  95%    198
  98%    287
  99%    340
 100%   1284 (longest request)
2020/01/26 16:41:59 Matched stat line [Connect:        0   23  81.2      8    1068 Connect 0 23 81.2 8 1068]
2020/01/26 16:41:59 Matched stat line [Processing:     0   38  48.5     23     945 Processing 0 38 48.5 23 945]
2020/01/26 16:41:59 Matched stat line [Waiting:        0   37  44.1     23     695 Waiting 0 37 44.1 23 695]
2020/01/26 16:41:59 Matched stat line [Total:          1   62 100.3     34    1284 Total 1 62 100.3 34 1284]
2020/01/26 16:41:59 Matched percentline [  50%     34 50 34]
2020/01/26 16:41:59 Matched percentline [  66%     54 66 54]
2020/01/26 16:41:59 Matched percentline [  75%     71 75 71]
2020/01/26 16:41:59 Matched percentline [  80%     82 80 82]
2020/01/26 16:41:59 Matched percentline [  90%    129 90 129]
2020/01/26 16:41:59 Matched percentline [  95%    198 95 198]
2020/01/26 16:41:59 Matched percentline [  98%    287 98 287]
2020/01/26 16:41:59 Matched percentline [  99%    340 99 340]
2020/01/26 16:41:59 Matched percentline [ 100%   1284 100 1284]